-- Задача 3 (10 точки). Дадени са следните дефиниции на програмните езици Haskell и Scheme, от
-- програмния код на които липсват части. Попълнете полетата, обозначени с ______ с
-- необходимия програмен код така, че да се получат посочените желани оценки. Изберете само
-- един от двата езика за решението на задачата и напишете името му в даденото за целта поле.
-- Точки за задачата се дават само за избрания от вас език.
-- Избран език: Haskell

-- 1 
-- merge x [] = ____
-- merge ___ ___ = ___
-- merge (x:xs) (y:ys) = if x < y
-- then __________________________________
-- else __________________________________

-- израз: merge [1,3,5,7] [2,2,6,10]
-- желана оценка: [1,2,2,3,5,6,7,10]

-- 2
-- израз: (\____­>[y|y<­_____,even ____])[1,2,3,4]
-- желана оценка: [2,4]

-- Solution:
merge x [] = x
merge [] y = y
merge (x:xs) (y:ys) = if x < y then x : merge (xs) (y:ys) else y : merge (x:xs) (ys)

anonymous ls = (\ys -> [ y | y <- ys, even y]) ls

main = do
    
    print (merge [1,3,5,7] [2,2,6,10])
    print (anonymous [1,2,3,4])
