-- Задача 3.
-- 1. Дадени да следните дефиниции на функция, съответно на програмните езици Haskell и Scheme, от
-- програмния код на които липсват части. Да се попълнят полетата, обозначени с ______, с
-- необходимия програмен код така, че да се получат посочените желани оценки.
-- 2. Дадени са следните изрази, съответно на програмните езици Haskell и Scheme. Да се посочи каква
-- е оценката на израза.
-- Изберете само един от двата езика за решението на задачата и напишете името му в даденото за целта
-- поле. Точки за задачата се дават само за избрания от Вас език.
-- Избран език: Haskell

-- 1. filterByChar c ls = filter ________________________________________ ls

-- израз: filterByChar 'o' ["cat", "cow", "dog"]
-- желана оценка: ["cow", "dog"]

-- 2. let (x:y):z = ["Curry"] in (x,y,z)
-- Оценка: (C,urry,[])

-- Solution:
filterByChar :: Char -> [String] -> [String]
filterByChar c ls = filter (\l -> c `elem` l) ls


main = do

    print (filterByChar 'o' ["cat", "cow", "dog"])
    print (let (x:y):z = ["Curry"] in (x,y,z))