-- Задача 3. Нека са дадени следните изрази на езиците Haskell и Scheme. Да се посочи
-- каква е оценката на изразите. Изберете само един от двата езика за решението на задачата и
-- напишете името му в даденото за целта поле. Точки за задачата се дават само за избрания от
-- Вас език.
-- Избран език: Haskell:

-- 1. [x:[x]|x<­[[1,2],[3,4]]]
-- Оценка: [[[1, 2], [1, 2]], [[3, 4], [3, 4]]]

-- 2. [map(f5)[1,2,3]|f<­[(+),(­),(*)]]
-- Оценка: [[6, 7, 8], [4, 3, 2], [5, 10, 15]]

-- 3. "a":[['b','c'],"d"]
-- Оценка: "a" = ['a'] : ["bc", "d"] = ["a", "bc", "d"]

main = do
    
    print ([ x:[x] | x <- [[1,2],[3,4]] ])
    print ([ map (f 5) [1,2,3] | f <- [(+),(-),(*)]])
    print ("a":[['b','c'],"d"])