-- Задача 3. (10 т.) При решението на задачата попълнете или само частта за Scheme или само
-- частта за Haskell. По-долу на листа е предвидено място, в което да посочите кой език сте
-- избрали. Ще се оценяват само и единствено решенията за езика, който сте посочили в това
-- поле. Ако не посочите език, задачата се оценява с нула точки.
-- Нека са дадени следните изрази на езиците Haskell и Scheme. Моля, посочете каква ще бъде
-- тяхната оценка за един от двата езика (по ваш избор).
-- Избран от вас език: Haskell

-- map (head [(\couple->fst couple + snd couple)]) (foldr1 (++) [[(1,2)],[(3,4)]])
-- Оценка: [3, 7]

-- [zip [x] [x] | x <- [1..5]]
-- Оценка: [[(1, 1)], [(2, 2)], [(3, 3)], [(4, 4)], [(5, 5)]]

-- map (\(x:y:z)->x:z) [[1,2,3],[2,3,1],[3,1,2]]
-- Оценка: [[1, 3], [2, 1], [3, 2]]

main = do

    print (foldr1 (++) [[(1,2)], [(3,4)]]) -- [(1, 2), (3, 4)]
    print (map (head [(\couple->fst couple + snd couple)]) (foldr1 (++) [[(1,2)],[(3,4)]]) )
    print ([zip [x] [x] | x <- [1..5]])
    print (map (\(x:y:z) -> x:z) [[1,2,3], [2,3,1], [3,1,2]])
